 //1.შექმენით პროგრამა რომელიც გკითხავთ "რა გქვია?", დაელოდება თქვენს პასუხს და გიპახუსებთ "გამარჯობა, თქვენი სახელი"
let name = prompt("What is your name?");

console.log(`Hello, ${name}, nice to meet you!`); 

//2.შექმენით პროგრამა, რომელიც მოგთხოვთ სიტყვის ან წინადადების (string) შეყვანას და შემდეგ გიჩვენებთ, თუ რამდენი სიმბოლოსგან შედგება თქვენი ჩანაწერი.
let string=prompt("What is the input string?");
console.log(`${string}  has ${string.length} characters.`);

//3.ბრჭყალები ხშირად სტრიქონის (string) დასაწყისისა და დასასრულის აღსანიშნავად გამოიყენება, მაგრამ ზოგჯერ, ე.წ. escape characters-ის დახმარებით, ამ წინადადებაში ციტატა ცალკე, ისევ ბრჭყალებით უნდა გამოვყოთ. შექმენით პროგრამა, რომელიც მოგთხოვთ ციტატისა და მისი ავტორის ჩაწერას, შემდეგ კი გაჩვენებთ ორივეს ისე, როგორც მაგალითშია.
let quotes = prompt("What is the quote?");
let said = prompt("Who said it?");
console.log(`${said} says, "${quotes}" `); 

//4.შექმენით პროგრამა, რომელიც მოგთხოვთ სტრიქონის ჩაწერას და შემდეგ იმავე ჩანაწერს მხოლოდ პატარა ასოებით გაჩვენებთ. პუნქტუაცია და სიმბოლოებს შორის სივრცეები (whitespace) უცვლელი უნდა დარჩეს.
 let string1= prompt("write the word:");
console.log(string1.toLowerCase()); 

//5.ზოგიერთი ადამიანი ლექციებს საკმაოდ სწრაფად კითხულობს; მათი შენელება ან თუნდაც, სიტყვებს შორის პაუზის გაკეთება კარგი იქნებოდა... შექმენით პროგრამა, რომელიც წინადადების ჩაწერას მოგთხოვთ, შემდეგ კი იმავე ჩანაწერს გაჩვენებთ, ოღონდ იმ განსხვავებით, რომ ამჯერად ასოებს შორის ყველა სივრცე (whitespace) მრავალწერტილით (...) იქნება ჩანაცვლებული.
 let word = prompt("ჩაწერე სიტყვა");
console.log(word.trimEnd("... "));
//6. Making Faces - სახეების მიღება
function convert(str){

}